package com.app.basics.net

/**
 * Created by 无人认领 on 2020/4/1.
 * name:
 * desc:
 * Tips:
 *
 */

object HttpCode {
    //B00000("请求成功"),
    const val SUCCESS = "200"
    /**
     * 平台异常
     */
    //P00001("系统忙碌中，请稍后再试！"),
    const val P00001 = "P00001"
    //P00002("应用异常,需要签名方法无签名对象"),
    const val P00002 = "P00002"
    //P00003("请求超时,请您稍后再试")
    const val P00003 = "P00003"
    //P00004("服务重启中,请稍等"),
    const val P00004 = "P00004"
    /**
     * 限流
     */
    //P00006("访问人数过多，请重试！"),
    const val P00006 = "P00006"
    /**
     * 降级
     */
    //P00007("访问人数过多，请稍后再试！"),
    const val P00007 = "P00007"
    /**
     * 用户模块,状态码以B1开头,如B10001,依次递增
     */
    //B10001("电话号码为空"),
    const val B10001 = "B10001"
    //B10002("非法请求")
    const val B10002 = "B10002"
    //B10003("电话号码格式不正确"),
    const val B10003 = "B10003"
    //B10004("请求非法,签名错误"),
    const val B10004 = "B10004"
    //B10005("请求非法,签名为空"),
    const val B10005 = "B10005"
    //B10006("请您登录后再来剁手噢"),
    const val B10006 = "B10006"
    //B10007("两次输入的登录或兑换密码不一致"),
    const val B10007 = "B10007"
    //B10008("您今天的尝试次数已超过限制，请24小时后重试。"),
    const val B10008 = "B10008"
    //B10009("您的操作过于频繁，请十分钟后重试。"),
    const val B10009 = "B10009"
    //B10010("您的操作过于频繁，请一分钟后重试。"),
    const val B10010 = "B10010"
    //B10011("验证码不存在"),
    const val B10011 = "B10011"
    //B10012("验证码错误"),
    const val B10012 = "B10012"
    //B10013("您已注册,请登录"),
    const val B10013 = "B10013"
    //B10014("两次输入的密码不一致"),
    const val B10014 = "B10014"
    //B10015("旧密码错误"),
    const val B10015 = "B10015"
    //B10016("注册失败,凭证错误"),
    const val B10016 = "B10016"
    //B10017("请重新登录"),
    const val B10017 = "B10017"
    //B10018("新密码不能与就旧密码相同噢"),
    const val B10018 = "B10018"
    //B10019("非法请求"),
    const val B10019 = "B10019"
    //B10020("兑换密码错误！"),
    const val B10020 = "B10020"
    //B20000("0"),
    const val B20000 = "B20000"
    //B20000("1"),
    const val B20001 = "B20001"
    //B20003("查询成功"),
    const val B20003 = "B20003"
    //B20004("新增成功"),
    const val B20004 = "B20004"
    //B20005("更新成功"),
    const val B20005 = "B20005"
    //B20006("删除成功"),
    const val B20006 = "B20006"
    //B20007("查询失败"),
    const val B20007 = "B20007"
    //B20008("新增失败"),
    const val B20008 = "B20008"
    //B20009("更新失败"),
    const val B20009 = "B20009"
    //B20010("删除失败"),
    const val B20010 = "B20010"
    //B20011("登录成功"),
    const val B20011 = "B20011"
    //B20012("退出成功"),
    const val B20012 = "B20012"
    //B20013("登录失败"),
    const val B20013 = "B20013"
    //B20014("账号或密码有误"),
    const val B20014 = "B20014"
    //B20015("账号和密码不能为空"),
    const val B20015 = "B20015"
    //B20016("请登录后再操作"),
    const val B20016 = "B20016"
    //B20017("您的账号因错误次数过多而被锁定，请2小时后重试"),
    const val B20017 = "B20017"
    //B20018("您的密码错误，还剩2次机会"),
    const val B20018 = "B20018"
    //B20019("您的密码错误，还剩1次机会"),
    const val B20019 = "B20019"
    //B20020("您今天的尝试次数已用完，请24小时后重试。"),
    const val B20020 = "B20020"
    //B20021("您的账号已被冻结，请联系客服进行处理"),
    const val B20021 = "B20021"
    //B20022("未知异常"),
    const val B20022 = "B20022"
    //B20023("您的账号已注册,请登录"),
    const val B20023 = "B20023"
    //B20024("您还没有实名认证"),
    const val B20024 = "B20024"
    //B20025("您无权访问"),
    const val B20025 = "B20025"
    //B20026("您还未注册"),
    const val B20026 = "B20026"
    //B60048("账户在otc不存在"),
    const val B60048 = "B60048"
    /**
     * 管理后台模块
     */
    //B30001("参数异常"),
    const val B30001 = "B30001"
    //B30002("暂无版本更新"),
    const val B30002 = "B30002"
    /**
     * 认证中心模块
     */
    //B40001("登录失败"),
    const val B40001 = "B40001"
    //B40002("用户不存在"),
    const val B40002 = "B40002"
    //B40003("请输入手机号"),
    const val B40003 = "B40003"
    // B40004("请输入密码"),
    const val B40004 = "B40004"
    //B40005("手机号格式错误，请检查"),
    const val B40005 = "B40005"
    //B40006("您的账号因错误次数过多而被锁定，请2小时后重试。"),
    const val B40006 = "B40006"
    //B40007("您的密码错误，还剩2次机会"),
    const val B40007 = "B40007"
    //B40008("您今天的尝试次数已用完，请24小时后重试。"),
    const val B40008 = "B40008"
    //B40009("您的账号已被冻结，请联系客服进行处理。"),
    const val B40009 = "B40009"
    //B40010("密码错误"),
    const val B40010 = "B40010"
    //B40011("您的账号异常，请重新登录"),
    const val B40011 = "B40011"
    //B00001("用户需要校验短信验证码"),
    const val B00001 = "B00001"
    /**
     * APP模块
     */
    //B50001("参数错误"),
    const val B50001 = "B50001"
    /**
     * 订单模块
     */
    //B60001("订单不存在"),
    const val B60001 = "B60001"
    //B60002("该订单异常"),
    const val B60002 = "B60002"
    //B60003("查询otc平台CCQ信息异常！"),
    const val B60003 = "B60003"
    //B60004("otc平台CCQ数量不足！"),
    const val B60004 = "B60004"
    //B60005("OTC平台CCQ数量不足！")
    const val B60005 = "B60005"
    //B60027("您还没有设置联系方式")
    const val B60027 = "B60027"
    //B60028("该订单已下架或被其他用户抢先兑换")
    const val B60028 = "B60028"
    //B60030("您当前有待确认订单待处理,不能产生新置换!")
    const val B60030 = "B60030"
    //B60008("当前为非官方置换时间，不能进行发布需求和置换置换")
    const val B60008 = "B60008"

    //没有网络/网络错误
    const val NETWORK_ERROR = "network_error"
}